#!/usr/bin/env python
# coding: utf-8

# In[11]:


#1.ตุ๊กแกตัวหนึ่ง ตกลงไปในบ่อที่มีความสูง H เมตร มันพยายามจะไต่ให้ถึงปากบ่อ ในเวลากลางวันตุ๊กแกไต่ขึ้นไปได้ U เมตร เวลากลางคืนมันนอนหลับจึงไม่ได้ไต่แต่กลับไถลลงมาเป็นระยะทาง D เมตร ให้เขียนโปรแกรมเพื่อหาว่าตุ๊กแกจะใช้เวลากี่วันในการไต่ออกจากบ่อ (กำหนดให้ตุ๊กแกเริ่มไต่ในเวลากลางวัน)
H = int(input("H: "))
U = int(input("U: "))
D = int(input("D: "))
k = 0
day = 1
while True:
    k = k+U
    if k>=H:
     break
    k = k-D
    day = day+1
print(day,"day(s).")


# In[13]:


#2.ให้เขียนโปรแกรมรับจำนวนเต็ม P และ N จากนั้นพิมพ์เลขตั้งแต่ 1 ถึง P ที่ N หารลงตัว 
p = int(input("Enter P: "))
n = int(input("Enter N: "))
for x in range(1,p+1):
    if  x%n == 0:
        print(x)


# In[16]:


#3.ร้านขายขนมเปียกปูนร้านหนึ่ง พยายามเพิ่มยอดขายโดยการเสนอโปรโมชั่นพิเศษ ถ้าคุณซื้อขนมเปียกปูนมากกว่า 5 อัน ที่มีมูลค่ารวมเกิน 70 บาท คุณจะได้ส่วนลด 15% 
count = int(input("ต้องการขนมเปียกปูน: "))
money = int(input("ราคา: "))
if count > 5 and money > 70:
   s = money-money*0.1
else:
   s = money
print("You have to pay",int(s),"bath.")


# In[15]:


#4.เสือตัวหนึ่ง ตกลงมาจากต้นไม้ที่มีความสูง H เมตร มันพยายามจะไต่ขึ้นไปที่เดิม ในเวลากลางวันเสือไต่ขึ้นไปได้ U เมตร เวลากลางคืนมันหมดแรงจึงไม่ได้ไต่แต่กลับไถลลงมาเป็นระยะทาง D เมตร ให้เขียนโปรแกรมเพื่อหาว่าเสือจะใช้เวลากี่วันในการไต่ต้นไม้ขึ้นไปที่เดิม (กำหนดให้เสือเริ่มไต่ในเวลากลางวัน)
H = int(input("H: "))
U = int(input("U: "))
D = int(input("D: "))
k = 0
day = 1
while True:
    k = k+U
    if k>=H:
     break
    k = k-D
    day = day+1
print(day,"day(s).")


# In[19]:


#5.มานะขายไก่ไป 18 กิโลกรัม ราคากิโลกรัมละ  80 บาท เอาเงินที่ขายได้ไปซื้อซูชิราคาชิ้นละ 10 บาท มาลีจะซื้อส้มได้กี่ผล *กำหนดให้ได้ส้ม 144 ผล*
F=int(input("ขายไก่ไป:"))
S=int(input("ราคากิโลกรัมละ:"))
Sushi=int(input("ส้มลูกละ:"))
money=F*S
count = int(money//Sushi)
print("จะได้ส้มปริมาณ:",count,"ลูก")
if count < 1:
    print("ไม่สามารถซื้อได้")
elif count > 150:
    print("เกินจำนวนที่ต้องการ")
else :
    count == 144
    print("ได้ครบตามจำนวน")


# In[20]:


#6.ให้เขียนโปรแกรมรับจำนวนเต็ม P และ G จากนั้นพิมพ์เลขตั้งแต่ 1 ถึง P ที่ G หารลงตัว 
p = int(input("Enter P: "))
g = int(input("Enter G: "))
for x in range(1,p+1):
    if  x%g == 0:
        print(x)


# In[21]:


#7.ร้านขายส้มโอร้านหนึ่ง พยายามเพิ่มยอดขายโดยการเสนอโปรโมชั่นพิเศษ ถ้าคุณซื้อส้มโอมากกว่า 6 ลูกที่มีมูลค่ารวมเกิน 90บาท คุณจะได้ส่วนลด 30% 
count = int(input("ต้องการส้มโอ: "))
money = int(input("ราคา: "))
if count > 6 and money > 50:
   s = money-money*0.1
else:
   s = money
print("You have to pay",int(s),"bath.")


# In[22]:


#8.กิ๊กมีเงิน 2000 บาทซื้อเนื้อวัวไป 15 กิโลกรัม ราคากิโลกรัมละ  100 บาท เอาเงินที่เหลือไปซื้อมะม่วงราคาลูกละ 20 บาท กิ๊กจะซื้อมะม่วงได้กี่ลูก *กำหนดให้ได้มะม่วง25 ลูก*
M=int(input("กิ๊กมีเงิน:"))
B=int(input("ซื้อเนื้อวัวไป:"))
P=int(input("เนื้อวัวกิโลกรัมล่ะ:"))
Pig=B*P
D=int(input("มะม่วงลูกละ:"))
money=(M-(B*P))
count = int(money//D)
print("จะได้มะม่วงปริมาณ:",count,"ลูก")
if count < 1:
    print("ไม่สามารถซื้อได้")
elif count > 60:
    print("เกินจำนวนที่ต้องการ")
else :
    count == 72
    print("ได้ครบตามจำนวน")


# In[27]:


#9.ให้เขียนรับตัวเลขฐาน 2 จากผู้ใช้ จากนั้นแปลงให้เป็นเลขฐานสิบ
x = input("Enter binary number: ")
d = len(x)-1
sum = 0
for y in x:
   if y == '1':
      sum = sum+2**d
   d = d-1
print(sum)


# In[25]:


#10.เขียนโปรแกรมรับจำนวนเต็ม จากนั้นพิมพ์จำนวนเต็มดังกล่าวออกมาทีละหลัก หลักละ 1 บรรทัด โดยพิมพ์จากหลักหน่วยก่อน
x = input("Enter number: ")
d = len(x)-1
while d != -1:
   print(x[d])
   d = d-1


# In[ ]:




